{"sections":{"main":{"type":"main-page","disabled":true,"settings":{}},"our_story_7MyBjr":{"type":"our-story","settings":{"image":"shopify:\/\/shop_images\/about-image.png","pre_text":"","title":"About","text":"<p>Riddle is a luxury fragrance oil and skincare brand established in 2013 in Venice Beach, CA, by Chelsea Voge. We are inspired to make people feel more confident through their scent. We wanted to make scents not necessarily for different people but for different occasions. We have seven signature scents, all of them with a distinct personality; some are great for subtle everyday wear; some are more sensual, some more playful, but all very unique. We also believe that less is more in the fragrance world. We create scents that are not overpowering but rather quietly inviting. Our oils sit close to the body and trail as the person walks or simply creates an aura around the person. The seven different scents come in roll-on oils, spray lotions, full-body oils, and candles. <\/p>","quote":"","button_text":"","button_link":"","button_style":"btn--primary","bg_color":"#ffffff","text_color":"#101820","padding_top":38,"padding_bottom":38}},"our_story_letter_Lmj3qU":{"type":"our-story-letter","settings":{"title":"A letter from the Founder","text":"<p>Hi there,\u2028\u2028<\/p><p>It's lovely to have you here.\u2028\u2028<\/p><p>My name is Chelsea Voge. I founded Riddle in 2013 while living in Venice Beach, CA. I never thought in my wildest dreams that I would be the owner of a fragrance company, but I love every minute of it. I always say that Riddle came to me to be it's mom. I have always had immense gratitude for the journey it has taken me on.\u2028\u2028<\/p><p>When I was a young girl, I would go to a local apothecary in my hometown of Memphis, TN. They had a small table in the middle of the store with about 100 fragrance oils. I would be there for half an hour smelling them all, over and over. They made me so happy, and I had a knack for detecting the different notes in them. My mom would let me buy a few each time, and I would go home and mix different ones, creating unique blends. I loved this activity and was pretty good at it.\u2028\u2028<\/p><p>I moved to Los Angeles in 2008 and had many jobs; I mainly was a nanny, worked in retail, and then began a career in the music industry. Nothing ever felt right, and I was a young adult trying to navigate the vastness of La La Land.\u2028\u2028<\/p><p>In 2013, I revisited my favorite childhood pastime, and I ordered several different fragrance oils from my hometown apothecary, which is still there to this day. The joy I felt opening that box and smelling all the oils was nothing short of beautiful nostalgia. I was flooded with childhood memories and felt like myself again.\u2028\u2028<\/p><p>One of the first blends I made was our now-known and loved \"Original\" scent. I immediately knew that it was the best thing I had ever smelled! I began wearing it around town, and people would stop me left and right to ask what it was. I didn't have a name for a while, but I told people I made it and to give me their number, and I would make some for them.\u2028\u2028<\/p><p>One day, I was getting a cup of coffee at a cafe when someone tapped me on the shoulder to ask me what scent I was wearing. I immediately said, \"It's a Riddle.\" That is when the name was born. It was the most obvious name and made perfect sense because everyone was captivated by trying to find out what it was.\u2028\u2028<\/p><p>I quickly made a website and asked a friend if she would stock it at her boutique. She obliged, and I now had an online and physical location to send people to.\u2028\u2028<\/p><p>One fateful day, several months later, I received an email from a famous fashion designer who told me that she had purchased Riddle in Venice and had been wearing it for months. She told me that French Vogue recently interviewed her, and they asked her what fragrance she wore; her answer was \"Riddle.\" I was shocked and excited; I couldn't wait to see Riddle printed in a Vogue magazine! It was just the boost I needed to get Riddle to more people. Orders began coming in from all over Europe, and the boutique was selling through it rapidly.\u2028\u2028<\/p><p>The rest is history.\u2028\u2028<\/p><p>I'm so happy that you found Riddle. I hope you love how it makes you feel and that it brings a smile to your face every time you smell it. I'm so grateful for you and happy to have you in the family.\u2028\u2028<\/p><p>Xx <\/p>","sign":"shopify:\/\/shop_images\/Chelsea_Signature.svg","bg_color":"#f2eadf","text_color":"#101820"}},"our_story_image_text_6hEmRV":{"type":"our-story-image-text","settings":{"image":"shopify:\/\/shop_images\/Fragrance_table_at_apothecary_in_Memphis_TN..png","text":"Fragrance table at apothecary in Memphis, TN."}}},"order":["main","our_story_7MyBjr","our_story_letter_Lmj3qU","our_story_image_text_6hEmRV"]}